Revit 2026 API
Railing.Flip Method
 Flips the railing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void Flip()
Public Sub Flip
public:
void Flip()
member Flip : unit -> unit
Exceptions
Exception | Condition
InapplicableDataException |  The railing has incorrect internal data.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace